readme.org
This file is part of Invabot.

Invabot is free software: you can redistribute it
and/or modify it under the terms of the GNU General
Public License as published by the Free Software
Foundation, either version 3 of the License, or
any later version.

Invabot is distributed in the hope that it will be
useful, but WITHOUT ANY WARRANTY; without even the
implied warranty of MERCHANTABILITY or FITNESS FOR A
PARTICULAR PURPOSE. See the GNU General Public License
for more details.

You should have received a copy of the GNU General
Public License along with Invabot. If not, see
<https://www.gnu.org/licenses/>

#+PROPERTY: header-args+ :comments both
#+PROPERTY: header-args+ :mkdirp yes
#+PROPERTY: header-args+ :padline yes
#+STARTUP: overview

#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+TITLE: Invabot

* Algorithme d'attribution des rôles
Cette section définit l'algorithme d'attribution des rôles, qui est
indépendant de /Discord/.

** Principe

Attribuer un rôle à chaque joueur, en optimisant la pertinence totale
des attributions.
** Licence
#+begin_src python :tangle algo.py
# This file is part of Invabot.

# Invabot is free software: you can redistribute it
# and/or modify it under the terms of the GNU General
# Public License as published by the Free Software
# Foundation, either version 3 of the License, or
# any later version.

# Invabot is distributed in the hope that it will be
# useful, but WITHOUT ANY WARRANTY; without even the
# implied warranty of MERCHANTABILITY or FITNESS FOR A
# PARTICULAR PURPOSE. See the GNU General Public License
# for more details.

# You should have received a copy of the GNU General
# Public License along with Invabot. If not, see
# <https://www.gnu.org/licenses/>

#+end_src

** Dépendances
#+begin_src python :tangle algo.py
  import numpy as np
  import pandas as pd
  from scipy.optimize import linear_sum_assignment

  from typing import Dict, List, Tuple
  import numpy.typing as npt

  NDArrayInt = npt.NDArray[np.int_]
#+end_src

** Données d'entrée
Les données d'entrées sont :
- un roster :: un ensemble de joueurs représenté par une
  [[https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html][DataFrame]]. Chaque ligne de cette structure représente un joueur
  ainsi que sa compétence (un entier) pour chaque rôle prédéfini.

- une stratégie :: un ensemble de rôles à attribuer,
  représenté par une [[https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html][DataFrame]], et structuré sous forme de groupes.

*** Données de test
 #+begin_src python :tangle algo.py
   def get_test_roster():
       url = "https://docs.google.com/spreadsheets/d/1FgtMvUQbLxP7qvXt2tnVwFFyX9KWnuREHu7o0RtX13M/gviz/tq?tqx=out:csv&sheet=Roster"
       return pd.read_csv(url).set_index('dtag')
 #+end_src
#+begin_src python :tangle algo.py
  def get_test_strat():
      url = "https://docs.google.com/spreadsheets/d/1FgtMvUQbLxP7qvXt2tnVwFFyX9KWnuREHu7o0RtX13M/gviz/tq?tqx=out:csv&sheet=Strat_principale"
      page = pd.read_csv(url)
      return page.iloc[0:5, 0:10]
#+end_src
** Identification des rôles à attribuer

La première étape consiste à extraire, depuis la stratégie d'entrée,
les rôles à attribuer.

#+begin_src python :tangle algo.py
  def extraction_roles(strat: pd.DataFrame) -> Dict[str, int]:
      roles = {}
      for index, row in strat.iterrows():
          for v in row:
              v = v.split(' ')[0]
              if v in roles:
                  roles[v] += 1
              else:
                  roles[v] = 1
      return roles
#+end_src

** Matrice de coûts
Maintenant que les rôles sont déterminés, l'objectif est d'affecter
pour chacun un joueur. C'est un classique d'optimisation combinatoire,
connu sous le terme de problème d'[[https://en.wikipedia.org/wiki/Assignment_problem][affectation]].

La programmation linéaire est une technique éprouvée pour résoudre ce
problème. L'idée est de représenter le problème par une matrice $C$ de
pertinence (ou de coût si minimisation), où chaque élément $C_{i,j}$
représente la pertinence d'attribuer le rôle $i$ au joueur $j$.

Nous avons besoin de créer la matrice $C$ ainsi que des labels de
lignes /rows/ et de colonnes /cols/ faisant le lien entre les index
$i$ et $j$ et les noms de rôles/joueurs.

 #+name: cout
 #+begin_src python :tangle algo.py
   def matrice_cout(roles: pd.DataFrame, roster: pd.DataFrame) -> Tuple[List[str], List[str], NDArrayInt]:
       cols = [k for k, v in roles.items() for _ in range(v)]
       rows = roster.index

       C = np.zeros((len(rows), len(cols)), dtype=int)

       for i, r in enumerate(rows):
           for j, c in enumerate(cols):
               C[i, j] = int(roster.at[r, c])
       return rows, cols, C
 #+end_src

** Résolution
Puis, il faut trouver la matrice d'assignation $X$ qui va maximiser la
pertinence totale de la manière suivante :

$$max \sum_{i} \sum_{j} C_{i,j} X_{i,j}$$

Nous utiliserons pour cela la fonction [[https://docs.scipy.org/doc/scipy/reference/generated/scipy.optimize.linear_sum_assignment.html][linear_sum_assignment]] de
[[https://docs.scipy.org/doc/scipy/index.html][Scipy]]. Ensuite, nous créons un dictionnaire avec les assignations
choisies.

#+begin_src python :tangle algo.py
  def solve(rows: List[str], cols: List[str], C: NDArrayInt) -> Dict[str, str]:
      row_ind, X = linear_sum_assignment(C, maximize=True)
      # score = C[row_ind, X].sum()
      return {p: cols[t] for p, t in zip(rows, X)}
#+end_src

** Exploitation des résultats
Remplissage de la composition des groupes en fonciton des assignations
calculées.
#+begin_src python :tangle algo.py
  def creation_compo(assignations: Dict[str, str], strat: pd.DataFrame, roster: pd.DataFrame) -> pd.DataFrame:
      filed_roles = {}
      for k, v in assignations.items():
          if v not in filed_roles:
              filed_roles[v] = [k]
          else:
              filed_roles[v] += [k]

      max_roles = {k: v.max() for k,v in roster.iteritems()}

      comp = strat.copy()
      for i, row in comp.iterrows():
          for j, v in row.items():
              label = ''
              if len(v.split(' ')) > 1:
                  v, label = v.split(' ')
              if v in filed_roles and filed_roles[v]:
                  p = filed_roles[v].pop()
                  role_txt = f"[{comp.at[i, j]}]({config['doc']['url']})"
                  comp.at[i, j] = f'{p} *{role_txt}* {roster.at[p, v] / max_roles[v]:.1f}'
      return comp
#+end_src
** Processus complet
 #+begin_src python :tangle algo.py
   def build_comp(roster: pd.DataFrame, strat: pd.DataFrame, config):
       roles = extraction_roles(strat)
       assignation = solve(*matrice_cout(roles, roster))
       return creation_compo(assignation, strat, roster)
 #+end_src
** Test algorithme

#+begin_src python :tangle algo.py
  import json
  <<config>>
  if __name__ == '__main__':
      with open('config.json', 'r') as datafile:
          config = json.load(datafile)
      roster = get_test_roster()
      roster.to_csv('roster.csv')
      print(roster)
      strat = get_test_strat()
      strat.to_csv('strat.csv')
      print(strat)
      print(build_comp(roster, strat, config))
#+end_src


* Bot
** Concept :

 Le bot à pour objectif de générer une composition d'armée à partir des
 50 joueurs sélectionnés aléatoirement par le jeu.

** Configuration

 La configuration du bot passera par un fichier json unique, contenant
 le corps des différents messages à transmettre ainsi que les adresses
 des Gdoc à lire.
 #+begin_src json :tangle config.json :comments no
   {
   "ids": {
       "role": 917546013248606238,
       "leads": 928316217297612810
   },
   "doc":{
       "url": "https://virgile-dauge.github.io/invabot/"
   },
   "imgs": {
       "layout": "https://cdn.discordapp.com/attachments/917547596640296990/922901028519706674/layout.png"
   },
   "embeds": {
       "panneau": {
           "title": "Confirme ta séléction à l'invasion de",
           "color": 2003199,
           "description": "Réagis avec :ballot_box_with_check: à ce message **uniquement si tu es déjà dans le fort**. Attention, retourne vite en jeu, l'auto-AFK kick est rapide (2min). \n\n Si tu as réagi par erreur, merci de décocher ta réaction. :wink: \n\n*(Et si vous aussi vous pensez que bakhu est la meilleure guilde)*"
       },
       "dm": {
           "title": "Dis nous tout !",
           "color": 2003199,
           "description": "Tu es inscrit en invasion, mais tu n'as pas renseigné **les rôles** que tu peux jouer. Il n'est donc par conséquent pas possible de t'assigner un poste automatiquement. Allez, file remplir [ce document]("
       },
       "change": {
           "title": "Tu as changé ton discord TAG :/",
           "color": 2003199,
           "description": "Il faut mettre à jour tes infos. Allez, file remplir [ce document]("
       },
       "help": {
           "title": "Manuel d'utilisation d'invabot",
           "color": 2003199,
           "fields": [{"name": "Blue Team", "value": "Something", "inline" : "True"}]
       }
   },
   "gdoc": {
       "url": "https://docs.google.com/spreadsheets/d/1FgtMvUQbLxP7qvXt2tnVwFFyX9KWnuREHu7o0RtX13M/",
       "strats": {
           "Principale": "Strat_principale",
           "Secours": "Strat_secours"
       },
       "page_roster": "Roster",
       "form": "https://forms.gle/G9LizybajjVxCw6JA"
   }
   }
 #+end_src

** Utilitaires
